Revit 2024 API
CombinableElementArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CombinableElementArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CombinableElementArrayIterator
Visual C++
public:
virtual CombinableElementArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace